{
  "paragraphs": [
    {
      "body": "I bring over a decade of experience as a deeply integrated software engineer on teams implementing technological solutions. I have worked in media/journalism and for the federal government on agile, fast-paced teams. I have also had stints at startups."
    },
    {
      "body": "What I mean by deeply integrated is that my approach to software development includes a deep understanding of business and user needs as well as the approaches of design and project management. The more I understand in these areas, the better I can tailor solutions to meet needs more effectively and efficiently.",
      "example": "For example, I am interested, as possible, in being part of design and business processes to better understand the project landscape."
    },
    {
      "body": "In addition to being thorough in this way, I am flexible. I have learned tons of frameworks, libraries, and language features over the years. Given a bit of time to study, I can tackle anything new, bringing fresh eyes married with the wisdom of best practices.",
      "example": "I started out using obscure early PHP blogging platforms and then moved to Wordpress, to Drupal, a brief stint in Ruby on Rails, to more bespoke solutions using Python and, most recently, JavaScript. Within JavaScript alone I have learned frameworks all the way up from jQuery to the Backbone.js/Underscore.js days up through the ES6, React and Node ecosystems."
    },
    {
      "body": "I am also iterative. I know how to prevent perfect from being the enemy of good. Software is never perfect out of the gate. It’s important to do maintenance and improvements as you go. I don’t need to use the hot, new tools. I will work with whatever technologies make sense for the project. I am not an opinionated engineer in this regard. I have made mistakes in being too quick and too slow in my approachers over the years, and now you can benefit from my relative experience in finding the right speed.",
      "example": "NEEDED"
    },
    {
      "body": "I am thoughtful. I don’t make rash decisions. I know that the best work comes from consulting with other great minds and adhering to best practices refined by many. Sometimes the work is in piecing together parts and applying glue.",
      "example": "NEEDED"
    },
    {
      "body": "I am strategic in how I apply my efforts. The work of any sort of engineer is problem solving at the core. I am a professional solution seeker and, as needed, clarifying questioner. I am good with constraints and getting creative to make things work, borrowing from a decade of experience in doing so.",
      "example": "At one media company, I was asked to be the engineering team representative on a team to rethink the company’s product because of my ideas and engagement with the product beyond code."
    },
    {
      "body": "None of this is to mention my experience or approach as a leader. I have been mentoring and learning with colleagues for as long as I have had a career; it comes naturally to me. As an engineering leader, I bring all of the above with me as well as an attitude of service both to my team and to the organization. I was an engineering leader for almost four years in government and grew out an extremely high-performing new engineering department.",
      "example": "NEEDED"
    },
    {
      "body": "Thank you for reading this through and hearing me. A life’s work so far in breaking, fixing and creating software is hard to summarize much more succinctly. I am appreciative of your time."
    }
  ]
}
